#-------------------------------------1----------------------------------------------
#1. ვიქტორინა
# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები:
# 1. შუმერთა
# 2. სელჩუკთა
# 3. რომის
# 4. მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება: „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება: „სწორია!“


# answer = input('''
# რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?
# სავარაუდო პასუხები:
#  1. შუმერთა
#  2. სელჩუკთა
#  3. რომის
#  4. მონღოლთა
#
#  პასუხი: ''')
#
# if answer == '1' or answer == 'რომი' or answer == 'რომის':
#     print('სწორია')
# else:
#     print('არა! სწორი პასუხია რომის!')



#-------------------------------------2----------------------------------------------
# 2. ონლაინ მაღაზია
# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას.
# მაგ.
# 1. ლეპტოპები
# 2. პერსონალური კომპიუტერები
# 3. მობილურები
# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში.
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია შემოთავაზება.


# category = input('''
# აირჩიეთ კატეგორია:
#
# 1. ლეპტოპები
# 2. პერსონალური კომპიუტერები
# 3. მობილურები
#
# არჩევანის დაფიქსირება: ''')
#
# budget = int(input('''მაქსიმალური ბიუჯეტი(რიცხვი): '''))
#
# if category == 'ლეპტოპები' or category == '1':
#     if budget < 300:
#         print('ამ თანხაში შემოთავაზება არ მოიძებნა')
#     elif budget <= 1000:
#         print(f'Lenovo IdeaPad - {budget} GEL')
#     elif budget <= 2000 and budget > 1000:
#         print(f'Lenovo Thinkpad 2 Gen - {budget} GEL')
#     else:
#         print(f'Apple Macbook - {budget} GEL')
# elif category == 'პერსონალური კომპიუტერები' or category == '2':
#     if budget < 300:
#         print('ამ თანხაში შემოთავაზება არ მოიძებნა')
#     elif budget <= 1000:
#         print(f'პენტიუმ 3 - {budget} GEL')
#     elif budget <= 2000 and budget > 1000:
#         print(f'პენტიუმ 4 5-ის ნავაროტკებით - {budget} GEL')
#     else:
#         print(f'პენტიუმ 700 - {budget} GEL')
# elif category == 'მობილურები' or category == '3':
#     if budget < 300:
#         print('ამ თანხაში შემოთავაზება არ მოიძებნა')
#     elif budget <= 1000:
#         print(f'რედმი - {budget} GEL')
#     elif budget <= 2000 and budget > 1000:
#         print(f'სიაომი - {budget} GEL')
#     else:
#         print(f'აიფონი  - {budget} GEL')
# else:
#     print('კატეგორია არასწორია')



#-------------------------------------3----------------------------------------------
# 3. ქუესთის შედგენა (Text Based Adventure Game)
# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს მქომედების რამდენიმე ვარიანტს. სხვადასხვა არჩევანის შემთხვევაში თამაშ სხვადასხვანაირად ვითარდება.


# name = input('შეიყვანე სახელი: ')
# answer = input(f'''
# მოგესალმები {name}, შენ იმყოფები ნახალოვკაში. იმისათვის, რომ აქაურობას თავი დააღწიო შენ უნდა
# ამოხსნა სხვადასხვა ჩელენჯები, მზად ხარ?
#
# პასუხი(კი/არა): ''')
#
#
# if answer == 'კი':
#     ans1 = input('''
# იმისათვის რომ ნახალოვკიდან გახვიდე უნდა აირჩიო ტრანსპორტი:
#
# 1. მანქანა
# 2. ველოსიპედი
#
# აირჩიე: ''')
#     if ans1 == 'მანქანა' or ans1 == '1':
#         ans2 = input('''
# აირჩიე ფერი:
#
# 1. წითელი
# 2. შავი
#
# აირჩიე: ''')
#         if ans2 == 'წითელი' or ans2 == '1':
#             ans3 = input('წითელ მანქანას ახსნი? (კი/ვერა): ')
#             if ans3 == 'კი':
#                 print('გილოცავ შენ შეგიძლია დატოვო ნახალოვკა')
#             else:
#                 print('წააგე! ძველმა ბიჭებმა დაგიჭირეს და ვერ ახსენი წითელი მანქანა რატო გყავს')
#         elif ans2 == 'შავი' or ans2 == '2':
#             print('გილოცავ შენ ნებისმიერ დროს შეგიძლია დატოვო ნახალვკა')
#
#     elif ans1 == 'ველოსიპედი' or ans1 == '2':
#         ans2 = input('''
# მოვიდა საეჭვო გარეგნობის ყმაწვილი და გთხოვს, რომ ცოტა ხნით დასვა.
#
# დასვამ(კი/არა): ''')
#         if ans2 == 'კი':
#             print('ისევ ნახალოვკაში ხარ. ამჯერად უველოსიპედოდ')
#
#         elif ans2 == 'არა':
#             ans3 = input('შენი ველოსიპედი სწრაფია?(კი/არა): ')
#             if ans3 == 'კი':
#                 print('გილოცავ შენ გამოასწარი ნახალოვკელებს')
#             else:
#                 print('სამწუხაროდ შენ ისევ ნახალოვკაში ხარ, ოღონდ უველოსიპედოდ :)')
#
#     else:
#         print('არასწორად აირჩიე ტრანსპორტი!')
# else:
#     print('თამაში დასრულდა შენი ისევ ნახალოვკაში ხარ')



#-------------------------------------4----------------------------------------------
# 4. მომხმარებლისთვის კარიერის შერჩევა (არასავალდებულო)
# პროგრამა უსვამს მომხმარებელს რამდენიმე კითხვას
# (თქვენი იმპროვიზაციით) და ურჩევს მისთვის შესაფერის
# პროფესიას.


# answer = input('კომუნიკაბელური ხარ? (კი/არა): ')
#
# if answer == 'კი':
#     answ1 = input('მძიმე სტრესულ გარემოში მუშაობა გეხერხება? (კი/არა): ')
#     if answ1 == 'კი'
#         print('გაყიდვების მენეჯერი')
#     else:
#         print('ადამიანური რესურსების მართვის მენეჯერი')
# elif answer == 'არა':
#     answ1 = input('ოფისიდან მუშაობა გირჩევნია სახლიდან მუშაობას? (კი/არა): ')
#     if answ1 == 'კი'
#         print('მარკეტინგის მენეჯერი')
#     else:
#         print('პროგრამისტი')

