#----------------1----------------

# 1.	რეკურსიის დახმარებით შექმენი ფუნქცია, რომელიც იმდენჯერ დაბეჭდავს მისალმებას, რა რიცხვსაც გადასცემ არგუმენტად. (ციკლის გამოყენება არ შეიძლება)


# def print_func(num):
#     if num != 0:
#         print('Hi!',end='\n')
#         print_func(num-1)
#
# print_func(15)


#----------------2----------------

# 2.	შექმენი ფუნქცია, რომელიც მიიღებს შეკვეთას, ანუ კერძის სახელს და რაოდენობას და დაბეჭდავს მას, თუმცა
# რაოდენობას თუ არ მივუთითებთ შეცდომას არ ამოაგდებს და 1_ად ჩათვლის.


# def shekveta(kerdzi,qty=1):
#     print(kerdzi*qty)
#
# shekveta('xinkali',99)


#----------------3----------------


#3.	შექმენი ფუნქცია, რომელიც მიიღებს მინიმუმ 3 რიცხვს,  და დააბრუნებს და დაბეჭდავს ნარმავლს.

def mult(num1,num2,num3,*nums):
    num = num1*num2*num3
    for i in nums:
        num *= i
    return num

print(mult(2,2,2,2,2))



















